<?php
//-------------------------------------------------------
//函式: array_js1()
//用途: 1維陣列轉js陣列
//日期: 2011年10月31日
//作者: jeff@max-life
//-------------------------------------------------------

    function array_js1($arry){
    //---------------------------------------------------
    //PHP1維陣列轉js陣列
    //---------------------------------------------------

        if(!isset($arry)||!is_array($arry)){
            return '';
        }

        //處理陣列  第一層
        $temp=array();
        foreach($arry as $key=>$val){
            if(!is_numeric($val)){
                $temp[]="'{$val}'";
            }else{
                $temp[]="{$val}";
            }
        }

        //格式化
        $temp='['.implode(",",$temp).']'.';';

        //回傳
        return $temp;
    }
?>
