<?php
//-------------------------------------------------------
//func list
//-------------------------------------------------------
//  user/user_group/group_sid()     組別識別碼

      //---------------------------------------------------
      //設定與引用
      //---------------------------------------------------

        //外掛函式檔
        $_funcs=array(
            trim('group_sid ')
        );

        foreach($_funcs as $inx=>$_func){
            if(!function_exists("{$_func}")){
                require_once("{$_func}/code.php");
            }
        }
?>