<?php
//-------------------------------------------------------
//函式: is_image()
//用途: 是否為圖片
//日期: 2011年12月2日
//作者: jeff@max-life
//-------------------------------------------------------

    function is_image($file){
    //---------------------------------------------------
    //是否為圖片
    //---------------------------------------------------
    //getimagesize()會傳回下列的圖片資訊(類型:陣列)
    //
    //[0]     => 800                        => 寬
    //[1]     => 600                        => 高
    //[2]     => 6                          => 圖片類型常數
    //[3]     => width="800" height="600"   => 寬高字串
    //[bits]  => 24                         => 位元深度
    //[mime]  => image/bmp                  => mime_type
    //
    //檔案不存在,或非圖檔時,回傳false
    //---------------------------------------------------
        if(!isset($file)||(trim($file)=='')){
            return false;
        }

        if(false===($info=@getimagesize($file))){
        //檔案不存在,或非圖檔時,回傳false
            return false;
        }else{
            return true;
        }
    }
?>