<?php
//-------------------------------------------------------
//範例
//-------------------------------------------------------

    //設定頁面語系
    header("Content-Type: text/html; charset=UTF-8");

    //設定文字內部編碼
    mb_internal_encoding("UTF-8");

    //設定台灣時區
    date_default_timezone_set('Asia/Taipei');

    //外掛函式檔
    require_once("code.php");

    //---------------------------------------------------
    //測試
    //---------------------------------------------------

        $arry=array(
            "文字段落1",
            "文字段落2 文字段落2",
            "文字段落3 文字段落3 文字段落3",
            "   ",
            "文字段落4                      ",
            "文字段落5 文字段落5            ",
            "文字段落6 文字段落6 文字段落6  ",
            "   ",
            "    文字段落7",
            "     文字段落8 文字段落8",
            "       文字段落9 文字段落9 文字段落9",
            "",
            " 文 字段落a ",
            " 文  字段落b ",
            " 文   字段落c "
        );

        //輸出html
        $out=array_out($arry,$type='html');
        echo "{$out}";
        echo "<p>";

        //輸出text
        $out=array_out($arry,$type='text');
        echo "<pre>{$out}</pre>";
        echo "<p>";
?>