<?php
//-------------------------------------------------------
//函式: mb_getrnd_string_unique()
//用途: 隨機取回字串,雙位元,不可重複選到
//日期: 2011年10月29日
//作者: jeff@max-life
//-------------------------------------------------------

    function mb_getrnd_string_unique($str,$N,$encode){
    //---------------------------------------------------
    //隨機取回字串,雙位元,不可重複選到
    //---------------------------------------------------
    //$str      字串
    //$encode   文字內部編碼 UTF-8,UTF-8,GB2312,iso-2022-jp
    //---------------------------------------------------

        $L=mb_strlen($str,$encode);

        $arr=array();
        for($i=0;$i<$L;$i++){
            $c=mb_substr($str,$i,1,$encode);
            $arr[]=$c;
        }
        shuffle($arr);

        if($N<$L){
            //位置0,抓N個
            $arr=array_slice($arr,0,$N);
        }

        return implode($arr);
    }
?>