<?php
//-------------------------------------------------------
//函式: get_ip()
//用途: 取得客戶端IP
//日期: 2011年11月8日
//作者: jeff@max-life
//-------------------------------------------------------

    function get_ip(){
    //---------------------------------------------------
    //取得客戶端IP
    //---------------------------------------------------

        $ip="";
        if(isset($_SERVER["HTTP_X_FORWARDED_FOR"])){
            $ip=$_SERVER["HTTP_X_FORWARDED_FOR"];
        }else{
            $ip=$_SERVER["REMOTE_ADDR"];
        }
        return $ip;
    }
?>
