<?php
//-------------------------------------------------------
//函式: get_http_prefix()
//用途: 取得主機網址
//日期: 2011年10月29日
//作者: jeff@max-life
//-------------------------------------------------------

    function get_http_prefix(){
    //---------------------------------------------------
    //取得主機網址
    //---------------------------------------------------
    //本函式會取回目前主機網址
    //
    //可能值如下
    //
    //http://127.0.0.1
    //http://127.0.0.1:8080
    //---------------------------------------------------
        if(isset($_SERVER['HTTPS']) && strtolower($_SERVER['HTTPS'])!='off'){
            $SCHEMA="https";
        }else{
            $SCHEMA="http";
        }

        //localhost or localhost:8080
        $HOST=$_SERVER['HTTP_HOST'];
        return "{$SCHEMA}://{$HOST}";
    }
?>