<?php
//-------------------------------------------------------
//函式: meta()
//用途: 標籤
//日期: 2015年4月25日
//作者: mssr_team@cl_ncu
//-------------------------------------------------------

    //---------------------------------------------------
    //測試
    //---------------------------------------------------

        //$meta=meta($rd=0);
        //echo '<pre>';
        //print_r($meta);
        //echo '</pre>';

    function meta($rd=0){
    //---------------------------------------------------
    //函式: meta()
    //用途: 標籤
    //---------------------------------------------------
    //$rd   層級指標,預設0,表示在目前目錄下
    //---------------------------------------------------

        //-----------------------------------------------
        //參數檢驗
        //-----------------------------------------------

            if(!isset($rd)||(int)$rd===0){
                $rd='';
            }else{
                $rd=str_repeat('../',$rd);
            }

        //-----------------------------------------------
        //設定
        //-----------------------------------------------

            //-------------------------------------------
            //html  內容
            //-------------------------------------------

                $html="
                    <meta charset='utf-8'>
                    <meta http-equiv='X-UA-Compatible' content='IE=edge'>
                    <meta name='viewport' content='width=device-width, initial-scale=1'>
                    <meta http-equiv='content-language' content='utf-8'>
                    <meta http-equiv='content-type' content='text/html;charset=utf-8'>
                    <meta name='keywords' content='明日聊書' />
                    <meta name='description' content='明日聊書' />
                    <meta name='msvalidate.01' content='' />
                    <meta name='robots' content='index,follow,snippet,archive'>
                ";

        //-----------------------------------------------
        //處理
        //-----------------------------------------------

            if(1==2){ //除錯用
                echo '<pre>';
                print_r($html);
                echo '</pre>';
            }

        //-----------------------------------------------
        //回傳
        //-----------------------------------------------

            return $html;
    }
?>