<?php
//-------------------------------------------------------
//範例
//-------------------------------------------------------

    //SESSION
    session_start();

    //設定頁面語系
    header("Content-Type: text/html; charset=UTF-8");

    //設定文字內部編碼
    mb_internal_encoding("UTF-8");

    //設定台灣時區
    date_default_timezone_set('Asia/Taipei');

    //---------------------------------------------------
    //外掛
    //---------------------------------------------------

        require_once(str_repeat("../",3)."config/config.php");
        require_once(str_repeat("../",1)."code.php");

    //---------------------------------------------------
    //測試
    //---------------------------------------------------
    //a           系統使用者      1           $_SESSION['a']['user_id']
    //t           教師使用者      3           $_SESSION['t']['user_id']
    //s           學生使用者      5           $_SESSION['s']['user_id']
    //am          協會成員使用者  7           $_SESSION['am']['user_id']

        $_SESSION['a']['user_id']='1';
        $_SESSION['t']['user_id']='3';

    //---------------------------------------------------
    //函式: login_check()
    //用途: 登入檢核
    //---------------------------------------------------
    //$types    使用者類型,陣列
    //
    //本函式會檢核登入的使用者類型,如果不指定類型,只要符合
    //任何一種,便算是ok,並回傳布林值.
    //---------------------------------------------------

        //判斷有無登入,不限使用者類型
        if(1==1){
            if(login_check()){
                echo "已登入"."<br/>";
            }else{
                echo "未登入"."<br/>";
            }
        }


        //判斷是不是登入成 系統使用者 或 教師使用者
        if(1==1){
            if(login_check(array('a','t'))){
                echo "已登入"."<br/>";
            }else{
                echo "未登入"."<br/>";
            }
        }

        //不存在的使用者類型
        if(1==1){
            if(login_check(array('xxx'))){
                echo "已登入"."<br/>";
            }else{
                echo "未登入"."<br/>";
            }
        }
?>