<?
//-------------------------------------------------------
//版本編號 1.0
//登記書籍  讀取閱讀登記 Q & A
//ajax
//-------------------------------------------------------

	//---------------------------------------------------
	//輸入 user_id
	//輸出
	//---------------------------------------------------

	//---------------------------------------------------
	//設定與引用
	//---------------------------------------------------

	//SESSION
	@session_start();

	//啟用BUFFER
	@ob_start();

	//外掛設定檔
	require_once(str_repeat("../",4)."/config/config.php");

	//外掛函式檔
	$funcs=array(
				APP_ROOT.'inc/conn/code',
				APP_ROOT.'lib/php/db/code'
				);
	func_load($funcs,true);


	//清除並停用BUFFER
	@ob_end_clean();

	//建立連線 user
	$conn_mssr=conn($db_type='mysql',$arry_conn_mssr);
	//-----------------------------------------------
	//通用
	//-----------------------------------------------

	//-------------------------------------------
	//初始化, curl設定
	//-------------------------------------------
		$array =array();
		$array["error"] = "";
		$array["echo"] ="";
        //POST


	//---------------------------------------------------
    //設定參數 檢驗參數
    //---------------------------------------------------

		//POST
       	$user_id        =(isset($_POST['user_id']))?(int)$_POST['user_id']:0;
		$user_permission=(isset($_POST['user_permission']))?$_POST['user_permission']:0;

		if($user_id != $_SESSION["uid"] || $user_permission != $_SESSION["permission"])
		{
			$array["error"] ="你違法進入了喔!!  請重新登入";
			die(json_encode($array,1));
		}

	//-------------------------------------------
	//SQL
	//-------------------------------------------

		$array["quest"] = array(
			1 => "請點選閱讀狀況",
			2 => "你覺得這本書的難度是",
			5 => "請點選喜愛程度",
			4 => "你會不會想要再看一次這本書嗎",
			3 => "你為甚麼會選擇讀這本書",
			6 => "這本書你看了幾頁");

			$array["answer"] =array(
			1 => array(
				1 => "全部讀完",
				2 => "讀超過一半",
				3 => "只讀少部分"),
			2 => array(
				1 => "輕鬆好讀",
				2 => "難度剛好",
				3 => "有挑戰性"),
			5 => array(
				1 => "非常喜歡",
				2 => "喜歡",
				3 => "普通",
				4 => "不喜歡",
				5 => "非常不喜歡"),
			4 => array(
				1 => "會",
				2 => "不會"),
			
			3 => array(
				1 => "朋友推薦給我的",
				2 => "書的名字吸引我",
				3 => "書的封面或插圖吸引我",
				4 => "書的封面文字介紹吸引我",
				5 => "喜歡這位作者"),
			6 => array(
				1 => "好多頁")
			);




		for($i = 1 ; $i <= sizeof($array["quest"]);$i++)
		{
			$array["answer_count"][$i] = sizeof($array["answer"][$i]);

		}
		$array["quest_count"] = sizeof($array["quest"]);
		echo json_encode($array,1);


		?>