<?php
//-------------------------------------------------------
//函式: const_print()
//用途: 列印出自訂常數
//日期: 2011年10月29日
//作者: jeff@max-life
//-------------------------------------------------------

    function const_print(){
    //---------------------------------------------------
    //函式: const_print()
    //用途: 列印出自訂常數
    //---------------------------------------------------

        //以分類方式,取得常數陣列
        $arr=get_defined_constants(true);

        //列出自訂常數
        echo '<pre>';
        print_r($arr['user']);
        echo '</pre>';

        die();
    }
?>