<?php
//-------------------------------------------------------
//範例
//-------------------------------------------------------

    //設定頁面語系
    header("Content-Type: text/html; charset=UTF-8");

    //設定文字內部編碼
    mb_internal_encoding("UTF-8");

    //設定台灣時區
    date_default_timezone_set('Asia/Taipei');

    //---------------------------------------------------
    //函式: tx_sys_sid()
    //用途: 物品交易識別碼(系統專用)
    //---------------------------------------------------
    //$create_by    建立者
    //$encode       頁面編碼
    //
    //---------------------------------------------------
    //字首: mts + create_by(建立者) + YYYYMMDDhhiiss + 亂數組成，共25碼，
    //      mts + 1 + 20130101000000 + 0000001
    //---------------------------------------------------

        //外掛設定檔
        require_once(str_repeat("../",1)."code.php");
        echo tx_sys_sid(1,mb_internal_encoding());
?>
