<?php
//-------------------------------------------------------
//函式: br2nl_deep()
//用途: 取代br轉nl,回遞套用
//日期: 2013年1月22日
//作者: jeff@max-life
//-------------------------------------------------------

    function br2nl_deep($val){
    //---------------------------------------------------
    //取代br轉nl,回遞套用
    //---------------------------------------------------

        $nl="\r\n";
        $replace=array(
            "</BR>"=>$nl,
            "</br>"=>$nl,
            "</Br>"=>$nl,
            "</bR>"=>$nl,
            "<BR>" =>$nl,
            "<br>" =>$nl,
            "<Br>" =>$nl,
            "<bR>" =>$nl
        );

        if(is_array($val)){
            return array_map('br2nl_deep',$val);
        }else{
            return strtr($val,$replace);
        }
    }
?>