<?php
//-------------------------------------------------------
//函式: meta_description()
//用途: 頁面關鍵字描述設定
//日期: 2013年8月12日
//作者: mssr_team@cl_ncu
//-------------------------------------------------------

    //---------------------------------------------------
    //測試
    //---------------------------------------------------
    //meta_description($key='mssr');

    function meta_description($key=''){
    //---------------------------------------------------
    //函式: meta_description()
    //用途: 頁面關鍵字描述設定
    //---------------------------------------------------
    //$key  項目名稱
    //---------------------------------------------------

        //-----------------------------------------------
        //檢驗參數
        //-----------------------------------------------

            if(!isset($key)||trim($key)===''){
                $key='';
            }else{
                $key=strtolower($key);
            }

        //-----------------------------------------------
        //選單項目      中文名稱
        //-----------------------------------------------
        //mssr          明日閱讀

            $arrys=array(
                "mssr"=>array(
                    "name"  =>"mssr",
                    "cname" =>"明日閱讀",
                    "items" =>array(
                        '明日閱讀簡介'
                    )
                )
            );

        //-----------------------------------------------
        //處理
        //-----------------------------------------------

            $arry=array();
            if(isset($arrys[$key])&&!empty($arrys[$key])){
                $arry =$arrys[$key];
                $name =$arry['name'];
                $cname=$arry['cname'];
                $items=$arry['items'];
                $items=array_map('trim',$items);

                $nl="\r\n";
                $content=implode('',$items);
                //echo "<meta name='description' content='{$content}' />{$nl}";
            }
    }
?>