<?php
//-------------------------------------------------------
//函式: array_kvcombine()
//用途: 陣列元素,鍵值串接
//日期: 2011年12月1日
//作者: jeff@max-life
//-------------------------------------------------------

    function array_kvcombine($arry,$dchr='='){
    //---------------------------------------------------
    //陣列元素,鍵值串接
    //---------------------------------------------------
    //$arry 陣列
    //$dchr 元素鍵值串接字符,預設 =
    //---------------------------------------------------
        if(!isset($arry)||empty($arry)){
            return '';
        }

        $tmp=array();
        foreach($arry as $key=>$val){
            $tmp[]=$key.$dchr.$val;
        }
        return $tmp;
    }
?>