var constant={
	
	badWords:[

	"e04","fuck","shit","bitch","ass","whore","damn","ugly","asshole",
	"bastard","jerk","idiot","stupid","dumb","garbage","dick","penis",
	"dick","cock","nuts","ball","cunt","crack","pussy","fart","幹你娘",
	"幹您娘","幹恁娘","幹恁老母","幹恁老師","恁娘卡好","操你媽","媽的","馬的",
	"機掰","操機歪","操幾掰","幾掰","靠背","哭夭","哭爸","哭腰","哭邀","哭媽",
	"沒大腦","吃屎","狗屎","沒手沒腳","垃圾","豬頭","智障","白癡","白痴","破麻",
	"不要臉","很賤","很噁","超噁","超醜","無敵醜","超級醜","超噁","超賤","噁心","醜八怪","超臭","超醜","超爛","很爛","很醜",
	"廢物","怪胎","乞丐","機歪","王八蛋","懶叫","婊子","草枝擺","趕羚羊","賽羚羊",
	"蓋營養老雞排","太麻里隔壁","他奶奶的","雞巴毛","雞歪","賭爛","討厭","屌屁","吃屁"

	]
}