<?php
//-------------------------------------------------------
//函式: mb_getrnd_string()
//用途: 隨機取回字串,雙位元,可重複選到
//日期: 2011年10月29日
//作者: jeff@max-life
//-------------------------------------------------------

    function mb_getrnd_string($str,$N,$encode){
    //---------------------------------------------------
    //隨機取回字串,雙位元,可重複選到
    //---------------------------------------------------
    //$str      字串
    //$encode   文字內部編碼 UTF-8,BIG5,GB2312,iso-2022-jp
    //---------------------------------------------------
        $L=mb_strlen($str,$encode);
        if($N>=$L){$N=$L;}

        $arr=array();
        for($i=1;$i<=$N;$i++){
            //在隨機的位置取出一個
            $arr[]=mb_substr($str,mt_rand(0,mb_strlen($str,$encode)-1),1,$encode);
        }

        return implode($arr);
    }
?>