<?php
//-------------------------------------------------------
//教師中心
//-------------------------------------------------------

    //---------------------------------------------------
    //設定與引用
    //---------------------------------------------------

        //SESSION
        @session_start();

        //啟用BUFFER
        @ob_start();

        //外掛設定檔
        require_once(str_repeat("../",4).'config/config.php');

        //外掛函式檔
        $funcs=array(
                    APP_ROOT.'inc/code',
                    APP_ROOT.'center/teacher_center/inc/code',

                    APP_ROOT.'lib/php/db/code'
                    );
        func_load($funcs,true);

        //清除並停用BUFFER
        @ob_end_clean();

    //---------------------------------------------------
    //接收參數
    //---------------------------------------------------

    //---------------------------------------------------
    //設定參數
    //---------------------------------------------------

        $arry_filter_indecent=[
            '幹','幹你娘','操機歪','你娘被狗幹','你爸幹死狗','你母啊大懶趴','你爸操機歪','哭爸','哭母','馬的','屌','fuck','操',
            '哭腰','哭餐','哭爸死爸哭死你祖公啊十八代','狗母養的','沒大腦','沒手沒腳','做乞丐','垃圾堆長大',
            '豬圈洗澡','每天吃屎','破麻','你母啊娶細姨','你爸啊偷客兄','你母啊的細姨娶細姨','你爸啊的客兄偷客兄'
            ,'不要臉','看三小'
        ];
?>