
	var say = new Array();
	say[1] = new Array();
	say[1][0]=" 特殊的書籍封面代表老師給予的評價越高 ";
	say[1][1]=" 老師給予的評價會改變書籍封面<BR>分別為<a class='red_t'>最高分[金色]</a>、<a class='red_t'>高分[銀色]</a>、<a class='red_t'>中等[銅色]<BR>書籍封面代表三項推薦的平均得分，平均越高獎項越高</a>";
	say[1][2]="書面上的三個獎盃則代表<a class='red_t'>繪圖</a>、<a class='red_t'>文字</a>、<a class='red_t'>朗讀</a>各別推薦得到的評分";

	//改過
	say[2] = new Array();
	say[2][0]=" 可以將書籍上架或下架的功能 ";
	say[2][1]="如果想要上架書籍可以點選<a class='red_t'>[上架]</a>來選擇想上架的書籍，最高限制是10本；如果想要把書撤下來，點選想要撤下的書籍再按<a class='red_t'>[下架]</a>就可以將書籍移除";
	say[2][2]="<a class='red_t'>[瀏覽]</a>則可以觀看書籍推薦的內容";

