
	var say = new Array();
	say[1] = new Array();
	say[1][0]=" 查看最新訊息 ";
	say[1][1]=" 在這裡可以得知客人到你店裡做了什麼事，也可以知道老師(評鑑家)到你的店裡對你的推薦做了那些指導 ";
	say[1][2]=" 點開左側的驚嘆號可以展開列表，能更清楚的看到全部的內容<BR>另外有<a class='red_t'>[ $ ]</a>符號的代表有揆幣可領取喔";
	//改過 
	say[2] = new Array();
	say[2][0]=" 有包裹時請先點包裹進行進貨 ";
	say[2][1]="當你使用<a class='red_t'>閱讀登記[條碼版]</a>才會出現貨物，有貨物時請先點擊進行進貨動作，才有辦法開始進行推薦等後續活動喔";

	
	say[3] = new Array();
	say[3][0]=" 進行書店從這裡開始 ";
	say[3][1]=" 如果不知道怎麼開始經營書店，先從這三個項目開始吧!!<BR>首先從<a class='red_t'>[登記]</a>開始，進行閱讀登記，將看過的書籍登入書點中";
	say[3][2]=" 登記完成後，開始進行第2部分<a class='red_t'>[推薦]</a><BR><a class='red_t'>[推薦]</a>可以將你的書籍進行編寫的動作，依照推薦中的4個項目進行編寫";
	say[3][3]=" 推薦完成後可以進行第3個部分<a class='red_t'>[上架]</a><BR>推薦完成後必須將書籍<a class='red_t'>[上架]</a>才能讓其他人看到喔";	
	say[3][4]=" 如何?做書店其實只有這3個步驟，很簡單吧!!";	
	
	//改過 

	say[4] = new Array();
	say[4][0]=" 書店報表與設定書店個人化 ";
	say[4][1]=" 經營書店除了做推薦以外，還可以在這邊觀看經營的內容與設置個人化的書店 ;<a class='red_t'>[報表]</a>可以看到從書店開幕以來你的花費以及客人來店數與購買紀錄等";
	say[4][2]=" <a class='red_t'>[設定]</a>則可以對自己的書店做更改，可以訓練你的店員如何招呼客人也可以更改星球的樣式與設定宣言";

	
