
	var say = new Array();
	say[1] = new Array();
	say[1][0]=" 可選擇為列表排序 ";
	say[1][1]=" 點選按鈕可以選擇3種方式去排列書籍列表 ";
	say[1][2]="<a class='red_t'>[全部]</a>代表可以看到所有登記過的書籍";
	say[1][3]="<a class='red_t'>[可推薦]</a>代表只顯示可以做推薦的項目";
	say[1][4]="<a class='red_t'>[過期]</a>代表登記的書籍如果很久都沒做就會<a class='red_t'>[過期]</A>，書籍做過兩項以上的推薦就不會過期了喔";
	
	say[2] = new Array();
	say[2][0]=" 有做過推薦或是老師有做過指導就會出現各種符號 ";
	say[2][1]="有打勾代表著你對這本書做過了這項的推薦<BR>如果是比較特別的顏色代表老師對你的推薦做了一些指導";
	say[2][2]="如果看到綠色的勾，進到推薦編輯頁面看看老師給了你什麼樣的指導吧";
	say[2][3]="但如果出現了<a class='red_t'>紅色叉</a>，代表<a class='red_t'>老師刪除了你推薦的內容</a>，請進到推薦頁面重新推薦喔";
	
	say[3] = new Array();
	say[3][0]=" 已閱代表老師看過你的推薦 ";
	say[3][1]=" 如果老師有察看過你的推薦就會出現已閱的印章";


	say[4] = new Array();
	say[4][0]=" 登記書籍後太久沒做推薦就會過期 ";
	say[4][1]=" 登記書籍之後一直沒有去對這本書做推薦，書籍就會呈現灰色的過期現象，但不用擔心閱讀的資料會消失，登記過的資料還是會保留的，只是不能做推薦";
	say[4][2]=" 不想要讓過期發生的話，盡早做一些推薦就可以永久保留書籍<BR><a class='red_t'>保留條件只要做兩個以上的推薦就可以了</A>";
	say[4][3]=" 如果已過期的書想要對它做推薦，只要在閱讀一次書籍並做<a class='red_t'>閱讀登記</A>就可以做推薦";	
	
	say[5] = new Array();
	say[5][0]=" 進入說書人 ";
	say[5][1]=" 選擇書籍後點選說書人可以，可以對該書即進行說書人的活動";


	say[6] = new Array();
	say[6][0]=" 點選開始推薦 ";
	say[6][1]=" 選擇想要推薦的書籍後，點選<a class='red_t'>點籍推薦</A>的按鈕即可開始製作推薦";
