
	var say = new Array();
	say[3] = new Array();
	say[3][0]=" 點我開始錄音 ";
	say[3][1]="使用之前記得在電腦上面裝上麥克風，或是使用內建麥克風的電腦<BR>再來點選左上角的<a class='red_t'>允許</A>";
	say[3][2]="不清楚如何使用的話點選<img src='img/s1.png'>會有更詳細得圖解";
	say[3][3]="如過錄出來的聲音很小或者沒聲音，請檢查一下麥克風是否有開<BR>並檢查一下錄音的設定可以開高一些";
	
	say[2] = new Array();
	say[2][0]=" 點取可撥放已錄過的聲音 ";
	say[2][1]="符號總共有分成3個部分<a class='red_t'>[灰色勾勾]</a><a class='red_t'>[綠色勾勾]</a><a class='red_t'>[紅色叉叉]</a>";
	say[2][2]="<a class='red_t'>[灰色勾勾]</a>代表你做過了這項的推薦<BR><a class='red_t'>[綠色勾勾]</a>則代表老師評論了你這項推薦";
	say[2][3]="<a class='red_t'>[紅色叉叉]</a>代表老師刪除了你推薦的內容，請認真推薦喔";
	
	say[1] = new Array();
	say[1][0]=" 開始使用錄音的功能 ";
	say[1][1]=" 老師看過你的推薦就會出現<a class='red_t'>[已閱]</A>的印章";


